app/controllers/hospitals_controller.rb

  def index
  	@lon=params[:lon]
  	@lat=params[:lat]
  	if params[:search].present?
  		@heading_data="Hospitals Near to your location"
  		@timy="Maximum time taken by Ambulance: 12mins "
  		@hospitals = Hospital.near(params[:search],5)
  	else
  		@heading_data="Hospitals List"

  		@hospitals = Hospital.all
---
SELECT hospitals.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((44.3731103 - hospitals.latitude) * PI() / 180 / 2), 2) + COS(44.3731103 * PI() / 180) * COS(hospitals.latitude * PI() / 180) * POWER(SIN((-71.6101011 - hospitals.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((hospitals.longitude - -71.6101011) / 57.2957795), ((hospitals.latitude - 44.3731103) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM `hospitals`  WHERE (hospitals.latitude BETWEEN 44.25732487351132 AND 44.48889572648868 AND hospitals.longitude BETWEEN -71.77208385120919 AND -71.4481183487908 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((44.3731103 - hospitals.latitude) * PI() / 180 / 2), 2) + COS(44.3731103 * PI() / 180) * COS(hospitals.latitude * PI() / 180) * POWER(SIN((-71.6101011 - hospitals.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 8)  ORDER BY distance ASC

  def show
  	@hospital = Hospital.find(params[:id])
---
SELECT hospitals.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((12.8948 - hospitals.latitude) * PI() / 180 / 2), 2) + COS(12.8948 * PI() / 180) * COS(hospitals.latitude * PI() / 180) * POWER(SIN((77.5986 - hospitals.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((hospitals.longitude - 77.5986) / 57.2957795), ((hospitals.latitude - 12.8948) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM `hospitals`  WHERE (hospitals.latitude BETWEEN 12.779014573511322 AND 13.010585426488678 AND hospitals.longitude BETWEEN 77.47981909143324 AND 77.71738090856677 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((12.8948 - hospitals.latitude) * PI() / 180 / 2), 2) + COS(12.8948 * PI() / 180) * COS(hospitals.latitude * PI() / 180) * POWER(SIN((77.5986 - hospitals.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 8 AND hospitals.id != 2)  ORDER BY distance ASC

  def create
  	@hospital = Hospital.new(hospital_params)
  		if @hospital.save
---
INSERT INTO `hospitals` (`address`, `created_at`, `latitude`, `longitude`, `name`, `number`, `updated_at`) VALUES ('154/9, Bannerghatta Road, Opposite IIm - B, Bangalore-560076', '2015-01-30 21:57:47', 12.894769, 77.598646, 'Fortis Hospitals', '+918066214444', '2015-01-30 21:57:47')

  def edit
  	@hospital = Hospital.find(params[:id])
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 1 LIMIT 1

  def update
		@hospital = Hospital.find(params[:id])

		if @hospital.update(hospital_params)
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 3 LIMIT 1
UPDATE `hospitals` SET `address` = 'Adarsha Community Society,Bangalore', `latitude` = 12.9715987, `longitude` = 77.5945627, `name` = 'Adarsha Community Society', `updated_at` = '2015-01-30 22:38:38' WHERE `hospitals`.`id` = 4

  def destroy
		@hospital=Hospital.find(params[:id])
		@hospital.destroy
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 1 LIMIT 1
DELETE FROM `hospitals` WHERE `hospitals`.`id` = 1